Data/TestFiles/cases/SimpleHeatFin/case/0/FluidProperties/U
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/FluidProperties";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    wall001
    {
        type        noSlip;
    }

    inlet
    {
        type        fixedValue;
        value       uniform (0.0 0.1 0.0);
    }

    outlet
    {
        type        pressureInletOutletVelocity;
        value       uniform (0 0 0);
    }


    FluidProperties_to_heatsink
    {
        type        noSlip;
    }

    defaultFaces
    {
        type        noSlip;
    }
}

// ************************************************************************* //
