Data/TestFiles/cases/SimpleHeatFin/case/0/heatsink/p
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/heatsink";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000.0;

boundaryField
{
    heatsource001
    {
        type        calculated;
        value       $internalField;
    }


    // Derived from p_rgh at fluid-solid interface
    defaultFaces
    {
        type        calculated;
        value       $internalField;
    }
}

// ************************************************************************* //
