Data/TestFiles/cases/SimpleHeatFin/case/constant/FluidProperties/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/FluidProperties";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitT
{
    type            limitTemperature;
    active          yes;
    selectionMode   all;
    min             200;
    max             5000;
}

#includeIfPresent "fvOptionsScalarTransport"

// ************************************************************************* //
