Data/TestFiles/cases/SimpleHeatFin/case/constant/FluidProperties/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/FluidProperties";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    specie          specie;
    equationOfState perfectGas;
    thermo          hConst;
    transport       sutherland;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.964389774888698;
    }
    thermodynamics
    {
        Cp              1004.703;
        Hf              0;
    }
    transport
    {
        As              1.4579326545176254e-06;
        Ts              110.4;
    }
}

// ************************************************************************* //
