Data/TestFiles/cases/SimpleHeatFin/case/constant/heatsink/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/heatsink";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heatSource
{
    type            scalarSemiImplicitSource;
    active          false;
    selectionMode   all;
    volumeMode      specific;
    injectionRateSuSp
    {
        h    (0.0 0);
    }
}

// ************************************************************************* //
